Tekla Open API Reference for Tekla Structures 2025
ReinforcementMeshAttributes Constructor
Overload List
Name | Description
ReinforcementBase.ReinforcementMeshAttributes()
 Creates a new default reinforcement attributes instance that loads standard attributes.
ReinforcementBase.ReinforcementMeshAttributes(Boolean)
 Creates a new default reinforcement attributes instance that loads standard attributes. If it set to true attributes won't be lodaded.
ReinforcementBase.ReinforcementMeshAttributes(String)
 Creates a new reinforcement attributes instance that loads the specified attributes.
Top
See Also
Reference
ReinforcementBase.ReinforcementMeshAttributes Class
Tekla.Structures.Drawing Namespace